{
    "version": "https://jsonfeed.org/version/1",
    "title": "smpltn",
    "description": "",
    "home_page_url": "https://smpltn.com",
    "feed_url": "https://smpltn.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Rob Gale"
    },
    "items": [
        {
            "id": "https://smpltn.com/thumbnails.html",
            "url": "https://smpltn.com/thumbnails.html",
            "title": "Thumbnails",
            "summary": " This timelapse of thumbnail sketches shows part of my process for exploring visual ideas for an illustration. It’s part of a personal&hellip;",
            "content_html": "\n  <p>\n    This timelapse of thumbnail sketches shows part of my process for exploring visual ideas for an illustration. It’s part of a personal project I’ve been working on and I thought it would be fun to share a bit of work in progress.<br><br>Once I have a general idea of what the picture will be, I try to sketch out, super quickly, several rough compositions. I’ll generate between 20 and 30 of these small thumbnail sketches, spending no more than a few minutes on each one. <br><br>Doing this gives me the opportunity to try a lot of different options rapidly. The idea is to work out the big picture problems, problems like composition, blocking, character poses, etc. and give myself several options to compare against one another. The more time I spend here, the more I can get into a state of flow when I get to work on the final image, and it almost always helps me to a better end result.\n  </p>",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
            ],
            "date_published": "2022-02-16T11:37:00-08:00",
            "date_modified": "2022-02-16T17:37:36-08:00"
        },
        {
            "id": "https://smpltn.com/next-service.html",
            "url": "https://smpltn.com/next-service.html",
            "title": "Next Service",
            "summary": " Stephanie didn't tell Dave before she left. She knew if they talked about it, she would never make a move. So, after&hellip;",
            "content_html": "\n  <p>\n    Stephanie didn't tell Dave before she left. She knew if they talked about it, she would never make a move. So, after he left for work that morning, she got out of bed, packed a suitcase and grabbed the dog and threw them in her truck and was off.<br><br>It was past midnight now as she sped down the empty desert road. The wind pummeled her little white 4Runner and she could feel it jostle as she drove. Occasionally, a tumbleweed rolled by in front of her or brushed the side of the truck.<br><br>She'd always wanted to go to Joshua Tree, but she and Dave could never get out of their own inertia to do it, or much of anything else, really.<br><br>A song by Tom Waits played on the speakers and she sang along, imitating that gravelly voice as best as she could, and laughing at how far off hers was.<br><br>She felt good. Not about the fact that she hadn't said anything to Dave. He wasn't a bad guy, but every time she'd tried to talk about it, he just stood there, staring at her as she fumbled over her words. He was just listening, he'd say. She hated that.<br><br>Her phone rang. She stopped singing and looked at it and let it ring. Eventually, it stopped and the music came back on. Stephanie picked up the phone and, with one eye on the road and one eye on the phone, put it into airplane mode.<br><br>She took a deep breath. The dog looked up at her.<br><br>\"I'm not going to talk to him, Mr. Pimms. I just need some time. He'll deal.\"<br><br>She noticed a brightly lit gas station approaching and glanced at her fuel gauge. The bright lights blew out the dark of the surrounding landscape and it felt like she was landing on some planet among the stars in the sky.<br><br>There was not a person in sight. Inside the store was brightly lit, but she couldn't see anyone inside. The wind was howling, kicking up dust and tumbleweeds that floated into the light of the filling station. The only other visitors to this strange planet.<br><br>The little dog barked at her as she stepped out and swiped her card and put the nozzle in the tank. He scurried to the edge of the open door and looked down and leaped out, and went darting toward the shop.<br><br>\"Mr. Pimms!\"<br><br>The dog ran to the door of the shop.<br><br>\"You stay where I can see you!\"<br><br>He barked at the door, then when no one came out, he went scurrying toward the ice chest and disappeared behind the building.<br><br>\"Jesus… Mr. Pimms!\"<br><br>She paused, called his name again, then she left the pump still filling in the tank, and went to find him.<br><br>She rounded the corner of the building and the wind seemed to die down suddenly. She continued along the edge of the building and the pavement gave way to dirt and she saw an old garage in the dark behind the convenience store, with a single lamp casting a small pool of yellow light on the weeds.<br><br>\"Anyone back here? I have a knife if you're going to try and kill me!\"<br><br>She listened, watching the dark shadows. She saw the dog emerge into the yellow lamplight.<br><br>\"Mr. Pimms, I swear.\"<br><br>The pavement turned to dirt and the brambles scratched her legs as she approached the garage. Even though it had been a warm night, she felt cold, and she wrapped her arms around herself.<br><br>\"You're being very bad.\"<br><br>As she approached, she saw two arms reach down and pick up the dog and she froze. It was so quiet and she thought it was strange that she couldn't even hear the wind.<br><br>\"Hello?\"<br><br>The lamp light went out and only the light of the moon was left to dimly give its subtle illumination. A woman's feet emerged from the shadows of the old garage. Stephanie let out a small cry.<br><br>\"Oh my god. You scared me.\"<br><br>The woman wore a light summer dress and flat shoes and her skin was pale in the moonlight. She did not answer, but stood half in the dark and her face was obscured by the black of the shadows. The dog was calm in her arms.<br><br>\"I'm so sorry.\"<br><br>\"Running,\" the woman whispered.<br><br>\"You know how dogs are. Cooped up for too long.\"<br><br>Stephanie stood ten feet from the woman. She fidgeted, but did not dare move closer.<br><br>\"You can't run,\" the woman said, so quietly that it was barely a whisper, and yet Stephanie could hear the words clearly.<br><br>\"Mr. Pimms. You're being very bad,\" said Stephanie. She laughed uncomfortably. \"We don't mean to bother you. Come on Mr. Pimms.\"<br><br>\"Nowhere to go,\" said the woman.<br><br>The woman released the dog, and he ran back to Stephanie and as Stephanie squatted down to pick up the dog, she watched the woman turn to walk back into the shadow. Her pregnant silhouette showed for a moment in the moonlight, and as she disappeared back into the shadow, Stephanie noticed the butterfly tattoo on her right ankle.<br><br>Stephanie stood, and the light flickered back on and the woman was nowhere to be seen.<br><br>The sound of the wind picked up and Stephanie thought she heard a whisper of the song she was playing in the car on the wind and she hurried back through the brambles, out toward her car. She pulled the hose from the tank, and as she stepped back into the car, she looked at her own leg at at the tattoo on her right ankle. It was exactly the same.<br><br>\"Seriously,\" she said to herself as she got back into the car and slammed the door, and drove away.\n  </p>",
            "image": "https://smpltn.com/media/posts/41/2021-10-10-2.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "stories",
                   "images"
            ],
            "date_published": "2021-10-10T11:28:17-07:00",
            "date_modified": "2021-10-10T11:33:17-07:00"
        },
        {
            "id": "https://smpltn.com/2040.html",
            "url": "https://smpltn.com/2040.html",
            "title": "2040",
            "summary": " ",
            "content_html": "\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"\" data-is-external-image=\"true\"  height=\"900\" width=\"1600\" alt=\"\" />\n      \n    </figure>",
            "image": "https://smpltn.com/media/posts/40/rob-gale-experiments-2021-10-07-2.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-10-08T09:59:04-07:00",
            "date_modified": "2022-02-16T17:45:07-08:00"
        },
        {
            "id": "https://smpltn.com/imposter.html",
            "url": "https://smpltn.com/imposter.html",
            "title": "Imposter!!!",
            "summary": " ",
            "content_html": "\n  <p>\n    \n  </p>",
            "image": "https://smpltn.com/media/posts/39/2021-10-06.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-10-08T09:58:33-07:00",
            "date_modified": "2021-10-08T10:02:13-07:00"
        },
        {
            "id": "https://smpltn.com/rain.html",
            "url": "https://smpltn.com/rain.html",
            "title": "Rain",
            "summary": " ",
            "content_html": "\n  <p>\n    \n  </p>",
            "image": "https://smpltn.com/media/posts/38/2021-04-22.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-04-22T18:13:03-07:00",
            "date_modified": "2021-04-22T18:13:38-07:00"
        },
        {
            "id": "https://smpltn.com/nikes.html",
            "url": "https://smpltn.com/nikes.html",
            "title": "Nikes",
            "summary": " One yellow shoe. The other one, somewhere on the other side of town.&nbsp; ",
            "content_html": "\n  <p>\n    One yellow shoe. The other one, somewhere on the other side of town.&nbsp;\n  </p>",
            "image": "https://smpltn.com/media/posts/37/2021-04-20.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-04-20T16:59:43-07:00",
            "date_modified": "2021-04-20T17:52:41-07:00"
        },
        {
            "id": "https://smpltn.com/the-walking-tree.html",
            "url": "https://smpltn.com/the-walking-tree.html",
            "title": "The Walking Tree",
            "summary": " There's this fantastic extension for Blender called Quick Curve available on Gumroad. It allows you to \"draw\" in 3D space in Blender.",
            "content_html": "\n  <p>\n    There's this fantastic extension for Blender called <a href=\"https://gumroad.com/discover?query=quickcurve#EmBrX\" target=\"_blank\">Quick Curve</a> available on Gumroad. It allows you to \"draw\" in 3D space in Blender. It's hard to explain but it essentially lets you create quick, albeit rough 3D sketches and build out interesting organic forms quickly in Blender. It's targeted at concept artists and painters. It allowed me to quickly create a tree in 3D space, light it and bring it into photoshop to adjust and texture it and add it to my scene. Photos from <a href=\"https://unsplash.com\" target=\"_blank\">Unsplash</a>.\n  </p>",
            "image": "https://smpltn.com/media/posts/35/2021-03-24.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-03-24T11:47:04-07:00",
            "date_modified": "2021-04-20T17:52:59-07:00"
        },
        {
            "id": "https://smpltn.com/beware-the-bat-cave.html",
            "url": "https://smpltn.com/beware-the-bat-cave.html",
            "title": "Beware the Bat Cave",
            "summary": " With this piece I wanted to try getting myself more comfortable with Blender, so I challenged myself to start the process of&hellip;",
            "content_html": "\n  <p>\n    With this piece I wanted to try getting myself more comfortable with Blender, so I challenged myself to start the process of designing the environment in 3D. I'm a little slow with it because I'm just getting familiar with the way it works, but I can see how it could help speed the process along once I know what I'm doing. The trick is to keep it simple, knowing that I'm going to be going over everything with more detail in Photoshop.\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://smpltn.com/media/posts/34/2021-03-23-2-2.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://smpltn.com/media/posts/34/responsive/2021-03-23-2-2-xs.jpg 300w ,https://smpltn.com/media/posts/34/responsive/2021-03-23-2-2-sm.jpg 480w ,https://smpltn.com/media/posts/34/responsive/2021-03-23-2-2-md.jpg 768w ,https://smpltn.com/media/posts/34/responsive/2021-03-23-2-2-lg.jpg 1024w ,https://smpltn.com/media/posts/34/responsive/2021-03-23-2-2-xl.jpg 1360w ,https://smpltn.com/media/posts/34/responsive/2021-03-23-2-2-2xl.jpg 1600w\"  height=\"1080\" width=\"1920\" alt=\"\" />\n      <figcaption>3D render from Blender</figcaption>\n    </figure>\n\n  <p>\n    Once I had the basic block in of the environment and the lighting set up, I went into photoshop to add all the textures and the characters to the environment. As I often do, I found most of the textures here from a variety of photographers on <a href=\"https://unsplash.com/\">Unsplash</a>.\n  </p>",
            "image": "https://smpltn.com/media/posts/34/2021-03-23.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-03-23T15:59:42-07:00",
            "date_modified": "2021-04-20T17:53:17-07:00"
        },
        {
            "id": "https://smpltn.com/i-heart-peppers.html",
            "url": "https://smpltn.com/i-heart-peppers.html",
            "title": "I Heart Peppers",
            "summary": " I've been having loads of fun creating scenes that use a lot of collage elements with the central character painted and assembled&hellip;",
            "content_html": "\n  <p>\n    I've been having loads of fun creating scenes that use a lot of collage elements with the central character painted and assembled in Photoshop.&nbsp;\n  </p>\n\n  <p>\n    Images from <a href=\"https://unsplash.com/\" target=\"_blank\">Unsplash</a>:&nbsp;<a href=\"https://unsplash.com/photos/m1MRYp556Ew\" target=\"_blank\">T-Shirt</a>,&nbsp;<a href=\"https://unsplash.com/photos/KT7Fqi7F1pk\" target=\"_blank\">Diner</a> and <a href=\"https://unsplash.com/photos/wlIB1M8YTnY\" class=\"\" target=\"_blank\">Smoke</a>.\n  </p>",
            "image": "https://smpltn.com/media/posts/33/2021-03-18.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-03-18T15:55:07-07:00",
            "date_modified": "2021-04-20T17:54:00-07:00"
        },
        {
            "id": "https://smpltn.com/laughing-at-batman.html",
            "url": "https://smpltn.com/laughing-at-batman.html",
            "title": "Laughing at Batman",
            "summary": " ",
            "content_html": "\n  <p>\n    \n  </p>",
            "image": "https://smpltn.com/media/posts/32/2021-03-16.jpg",
            "author": {
                "name": "Rob Gale"
            },
            "tags": [
                   "images"
            ],
            "date_published": "2021-03-17T09:32:00-07:00",
            "date_modified": "2021-04-20T17:54:20-07:00"
        }
    ]
}
